tests/fixtures/Natures Plus Invoice 13103372.txt

Customer Service
Invoice
Phone:(0800)917-3084
Fax: (0800)096-4831
BACS Detail Email: lsoteriou@naturesplus.com
Bank NatWest
Account# 46312161 VAT REG NO: GB718284519 1 of 2
Sort code 60-21-40 OFF Code: GBORG04
*please reference your custome rnumber*
Bill To 10824 Information
Invoice Number 13103372
BEANFREAKS LTD
Invoice Date 25 February 2025
8 THE ROYAL ARCADE
Purchase Order No. PO0016322
CARDIFF
Purchase Order Date 25 February 2025
South Glamorgan
Picking List Number 11101775
CF10 1AE
Sales Order Number 3123880
Pymt Terms/Currency Net due in 30 days /GBP
Billing Date 25 February 2025
Ship To 122956
Sales Rep LOUIS SOTERIOU
BEANFREAKS LTD Territory/Region U3 /Z01
95 ALBANY RD Order Type/Broker OB
ROATH FOB/Freight Terms DDP /DELIVERY DUTY PREPAID
CARDIFF
South Glamorgan
CF24 3LP
Invoice Details
Item Material/Description Sug.Retail Lot# Qty Unit Price Amount Net Extension
________________________________________________________________________________________________________________
0020 UE29968 13.95 1388571 1 EA 6.16 6.16
AP KIDGREENZ CHEWABLE 90
_______U_P_C_:0_9_7_4_67_2_9_9_68_9_______________________N_e_t L_i_ne_ _Ex_t_en_s_io_n_______________ _ _ _6._1_6 _______________________________ _ _ _6_.1_6_ __
0010 UE29980 12.95 1385079 8 EA 5.72 45.76
AP ASSORTED CHEWABLE 90
_______U_P_C_:0_9_7_4_67_2_9_9_80_1_______________________N_e_t L_i_ne_ _Ex_t_en_s_io_n_______________ _ _ _5._7_2 ______________________________ _ _ _4_5._7_6 ___
0050 UE45961 30.95 M412469 3 EA 15.47 46.42
COLLAGEN POWDER W/VITAMIN C 280 G
_______U_P_C_:0_9_7_4_67_4_5_9_61_8_______________________N_e_t L_i_ne_ _Ex_t_en_s_io_n_______________ _ _15_._47_ ______________________________ _ _ _4_6._4_2 ___
0040 UE45971 24.95 M112466 1 EA 12.47 12.47
COLLAGEN CAPSULES 120
_______U_P_C_:0_9_7_4_67_4_5_9_71_7_______________________N_e_t L_i_ne_ _Ex_t_en_s_io_n_______________ _ _12_._47_ ______________________________ _ _ _1_2._4_7 ___
0030 UE4706 27.95 1385093 4 EA 12.35 49.38
BERBERINE 750MG CAP 60
UPC:097467047068 Net Line Extension 12.35 49.38
-------------------------------------------------------------
Total Net Ext 160.19
Total Tax/VAT 32.03
Grand Total 192.22
Support your Immune System with
NaturesPlus Herbal Actives.
NaturesPlus has some of the best products to support a healthy
immune system. Including Tri-Immune, Zinc Lozenges, Olive
Leaf and a variety of Vitamin C for the whole family.
Please remit payment via bank transfer and reference your customer number.
Product is intended for sale in the UK and for your direct sale to end consumers only. Diversion is prohibited. Use of third party
websites to sell product is prohibited. Products sold through unauthorised channels cannot be returned. Accepting delivery of this
order indicates agreement to our terms and conditions. See price list for further details.
Invoice
13103372
2 of 2
Invoice Details
Item Material/Description Sug.Retail Lot# Qty Unit Price Amount Net Extension
Tri-Immune Extended Release Tablets combine Olive Leaf, Arabino-
galactans and Andrographis. Tri-Immune is a synergistic immune
formula that offers the ultimate natural defense.
Immune Actin Zinc Lozenges are a botanical food supplement that
combine Zinc, Vitamin C, Elderberry, Olive Leaf, Wood Ear
Mushroom, Maitake, Shitake and Oyster Mushrooms is a convenient
and soothing raspberry and cherry flavoured lozenge.
Ask your NaturesPlus Rep for more information.
Please remit payment via bank transfer and reference your customer number.
Product is intended for sale in the UK and for your direct sale to end consumers only. Diversion is prohibited. Use of third party
websites to sell product is prohibited. Products sold through unauthorised channels cannot be returned. Accepting delivery of this
order indicates agreement to our terms and conditions. See price list for further details.